design_model/src/main/resources/结构型模式/代理模式/代理模式.md
```mermaid
classDiagram
    class Subject {
        <<Abstract>>
        +Request()*
    }
    class RealSubject {
        +Request();
    }
    class Proxy {
        -RealSubject realSubject;
        +PreRequest();
        +Reqeust();
        +PostReqeust();
    }
    Proxy --|> Subject
    RealSubject --|> Subject
    Proxy --> RealSubject : realSubject
    Client ..> Subject
```
