design_model/src/main/resources/结构型模式/代理模式/代理模式.puml
@startuml

abstract class Subject{
+{abstract} Request();
}

class RealSubject{
+Request();
}
class Proxy{
-RealSubject realSubject;
+PreRequest();
+Reqeust();
+PostReqeust();
}

Proxy -up--|> Subject
RealSubject -up-|>Subject

Proxy -right->RealSubject:realSubject

Client ..>Subject
@enduml
